###
## Creating and reading CSV Files:
###

In [10]:
import pandas as pd

a = pd.read_csv('name,age,gender.csv')
a

type(a)

a = pd.read_csv('name,age,gender.csv', index_col = 1)
#a
a

         Name  Gender
Age
20        Ali    Male
19   Mohammed    Male
21   Jennifer  Female
19     Rayyan    Male

##
#### The usecols parameter in pd.read_csv() is used to specify which columns from CSV file should be read into DataFrame while squeeze converts dataframe to series format:

In [2]:
# usecols, squeeze

import pandas as pd

a = pd.read_csv('name,age,gender.csv', usecols = ['Name']) 
a
type(a)

b = pd.read_csv('name,age,gender.csv', usecols = ['Name']).squeeze() # converts dataframe into series
b
#type(b)

0         Ali
1    Mohammed
2    Jennifer
3      Rayyan
Name: Name, dtype: object

###
### Importing Text Files :
###

In [19]:
# importing text files

import pandas as pd

a = pd.read_table('C:\\Users\\HP\\OneDrive\\Documents//textfile1..txt')
a

         Sr.no    Language      Country
0        1        Urdu          Pakistan
1             2        Arabic        KSA
2  3        English       United Kingdom

###
### Importing Excel Files :
###

In [5]:
# importing excel files that are not uploaded on jupyter

import pandas as pd

a = pd.read_excel(r'C:\\Users\\HP\\OneDrive\\Documents//marksfile1.xlsx')
a

# importing sheet 2 of a file

import pandas as pd

b = pd.read_excel(r'C:\\Users\\HP\\OneDrive\\Documents//marksfile1.xlsx', sheet_name = 'Sheet2')
b

        Name  Id
0     Rayyan  22
1      Ahmed  21
2      Samad  26
3      Abdul  89
4  Abu Bakar  76

###
### Creating Tables:
###

In [24]:
# 1_creating tables and saving as csv files

import pandas as pd

a = {'Country' : ['Pakistan','Afghanistan','Palestine'],'Famous Place' : ['Faisal Mosque','Band-e National Park','Al-Aqsa Mosque']}
b = pd.DataFrame(a)
b

b.to_csv('famous place(csvfile3).csv', index = False)
b

       Country          Famous Place
0     Pakistan         Faisal Mosque
1  Afghanistan  Band-e National Park
2    Palestine        Al-Aqsa Mosque

In [31]:
# changing column name

import pandas as pd

a = pd.read_csv('famous place(csvfile3).csv')
a

b = a.rename(columns = {'Country' : 'Country\'s Name' , 'Famous Place' : 'Famous Site'})
b

  Country's Name           Famous Site
0       Pakistan         Faisal Mosque
1    Afghanistan  Band-e National Park
2      Palestine        Al-Aqsa Mosque

In [32]:
# 2_creating tables

import pandas as pd

a = pd.DataFrame([['Corolla','Toyota',20],['Civic','Honda',35],['Bolan','Suzuki',29]] , columns = ['Car Name','Brand','Owner ID'])
a

  Car Name   Brand  Owner ID
0  Corolla  Toyota        20
1    Civic   Honda        35
2    Bolan  Suzuki        29

In [35]:
# 3_creating tables

import pandas as pd

a = [['Karachi','Sindh'],['Hyder Abad','Sindh'],['Lahore','Punjab'],['Islam Abad','Punab'],['Peshawar','KPK'],['Quetta','Balochistan']]
b = pd.DataFrame(a, columns = ['Cities','Province'])
b

# adding new column

b['Points'] = [10,9,9.5,10,9.5,8.5]
b.dtypes
b

       Cities     Province  Points
0     Karachi        Sindh    10.0
1  Hyder Abad        Sindh     9.0
2      Lahore       Punjab     9.5
3  Islam Abad        Punab    10.0
4    Peshawar          KPK     9.5
5      Quetta  Balochistan     8.5